# More information here
# http://polyglot.readthedocs.io/en/latest/NamedEntityRecognition.html
from polyglot.text import Text

blob = """
Христос Воскрес!

Сьогодні Лекторій СУА запрошує на відкриту лекцію «Осягнення жіночої реальності у літературі ХХІ ст. (аналіз творчості лауреаток Нобелівської премії в галузі літератури)»

Доповідачка: Легка Наталія  – к. філ. н., асистентка кафедри етики, естетики і культурології філософського факультету Київського національного університету імені Тараса Шевченка

Місце проведення: авд. 309, Гуманітарний факультет, вул. Козельницька, 2а
Час проведення: 16:20-18:00

___________________________

Проект УКУ “Дизайн-мислення у формуванні персональної кар'єри”


Цього разу студенти мають нагоду зустрітись з HR Business Partner Nestlé Мартою Сало.

Вона поділиться досвідом роботи в сфері HR, особливостями та основними челенджами в професії. 

Дізнайтесь як побудувати свою кар'єру в управлінні персоналом в четвер, 18 травня о 16:00.

Модеруватиме зустріч о. Павло Худ

Для участі заповніть коротку реєстраційну форму http://bit.ly/2obZ8x6

Про деталі зустрічі повідомимо на електронну скриньку.

Контактний e-mail: career_office@ucu.edu.ua
​___________________________

Інститут психічного здоров’я УКУ запрошує усіх охочих на майстерню Христини Гемптон (Christina Hempton, USA) «Арт-терапія + майндфулнес = емоційне благополуччя».


Христина Гемптон – арт-експресивний психотерапевт (США),  магістр мистецтв (МА from Lesley  University, Boston, USA), ліцензований практик у сфері психічного здоров’я (LMHC), фахівець у роботі з травмою в моделі ARC

Дата:    29 травня (понеділок)

Час:     14.00 – 19.00

Місце: Український католицький університет, Інститут психічного здоров’я, вул. Свєнціцького, 17, ауд. 045

АНКЕТА для реєстрації: https://goo.gl/forms/UoN6iRYdxcEE5dvz1

Просимо одягнути зручне вбрання, адже буде багато приємного руху та прикладного мистецтва, а також смачного частування  та корисного спілкування!

КОНТАКТИ: 096 303 84 75, 093 825 41 35,

clinical.psy@ucu.edu.ua
___________________________

​Кафедра богослов'я запрошує завтра, 18 травня взяти участь у відкритому науковому семінарі "Нові перспективи у християнській етиці"/ "New perspectives in Christian Ethics".
Доповідач - Йоган Де Таверньєр (Johan De Tavernier) – професор Факультету богослов’я та релігієзнавства Лювенського католицького університету, фахівець з морального богослов’я.
Мова - англійська. Початок о 16:00. Місце проведення - сенатська кімната (309) ФБФ УКУ.
Подія у facebook https://www.facebook.com/events/142274699647986/
​​___________________________

З 22 по 26 травня в Українському католицькому університеті проходитимуть заходи у рамках "Наукової весни 2017" у Львові:

22 травня:
16.30-18.30 - лекція-моновистава "Життя і смерть Івана Фещенка-Чопівського".

Доповідач - доктор технічних наук, громадський діяч, директор Центру Митрополита Андрея Шептицького Олег Яськів; Місце проведення: Лекторій УКУ (016 ауд.), вул. Козельницька 2а.

24 травня:
​​
12.00-13.30 - "Де закінчуються жарти? Проблема булінгу в житті сучасних школярів".

презентація та обговорення результатів наукового дослідження.

Організатор: факультет наук про здоров'я. Місце проведення: вул. Свєнціцького 17, ауд. 416 (конференц-зал).

14.00-15.30 - "Екзистенції сучасної молоді в різних країнах".

презентація та обговорення результатів кроскультурного дослідження.

Організатор: кафедра психології та психотерапії УКУ. Місце проведення: вул. Свєнціцького 17, ауд. 218.

16.00-17.30 - «Острів скарбів»: просто про роботу мозку людини". 

Організатор: кафедра клінічної психології УКУ. Місце проведення: вул. Свєнціцького 17, ауд. 218.

26 травня:
16.30-18.30 - лекція-моновистава "Ядерна держава Україна".

Доповідач - доктор технічних наук, громадський діяч, директор Центру Митрополита Андрея Шептицького Олег Яськів; Місце проведення: Лекторій УКУ (016 ауд.), вул. Козельницька 2а.

Щиро запрошуємо усіх бажаючих відвідати ці заходи та ближче познайомитися із розвитком науки в Українському католицькому університеті.

"""
text = Text(blob)

print(text.entities)